## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aks_prod.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/f083da20-f6a7-4a5c-9cbd-9398bba4ab60/resourceGroups/cst8918-final-project-group-7/providers/Microsoft.ContainerService/managedClusters/aks-prod"
        name                                = "aks-prod"
        tags                                = {}
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.aks_test.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/f083da20-f6a7-4a5c-9cbd-9398bba4ab60/resourceGroups/cst8918-final-project-group-7/providers/Microsoft.ContainerService/managedClusters/aks-test"
        name                                = "aks-test"
        tags                                = {}
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.remix_app.kubernetes_deployment.remix_weather_prod is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "remix_weather_prod" {
      ~ id               = "default/remix-weather-prod" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "remix-weather-prod"
          ~ resource_version = "107440" -> (known after apply)
          ~ uid              = "1fe731e6-b2a1-40fd-bc3d-4969d6947764" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (12 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "remix-weather"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.remix_app.kubernetes_deployment.remix_weather_test is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "remix_weather_test" {
      ~ id               = "default/remix-weather-test" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "remix-weather-test"
          ~ resource_version = "107203" -> (known after apply)
          ~ uid              = "3c4b262c-b0b8-4a0f-a5e0-cabb482f98d5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (12 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "remix-weather"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>